Catalogs/ДополнительныеКодыAudapadWeb.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<Catalog>
		<Properties>
			<Name>ДополнительныеКодыAudapadWeb</Name>
			<Comment>Дополнительные коды Audapad Web</Comment>
			<Hierarchical>true</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>КодПоКлассификатору</Name>
					<Comment>Код по классификатору</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>2</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТипНачисления</Name>
					<Comment>Тип начисления</Comment>
					<Type>
						<v8:Type>cfg:EnumRef.ТипыНачисленийДопКодов</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТипРаспределения</Name>
					<Comment>Тип распределения</Comment>
					<Type>
						<v8:Type>cfg:EnumRef.ТипыРаспределенияДопКодов</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СкидкаНаценка</Name>
					<Comment>Скидка/Наценка</Comment>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>БазаДляРасчета</Name>
					<Comment>База для расчета</Comment>
					<Type>
						<v8:Type>cfg:EnumRef.ТипыБазДляРасчетаДопКодов</v8:Type>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

Enums/ТипыНачисленийДопКодов.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<Enum>
		<Properties>
			<Name>ТипыНачисленийДопКодов</Name>
			<Comment>Типы начислений доп. кодов</Comment>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Процент</Name>
					<Comment>Процент</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Сумма</Name>
					<Comment>Сумма</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>РП</Name>
					<Comment>РП</Comment>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Enums/ТипыРаспределенияДопКодов.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<Enum>
		<Properties>
			<Name>ТипыРаспределенияДопКодов</Name>
			<Comment>Типы распределения доп. кодов</Comment>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>НаТовары</Name>
					<Comment>На товары</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>НаРаботы</Name>
					<Comment>На работы</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>НаТоварыИРаботы</Name>
					<Comment>На товары и работы</Comment>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Enums/ТипыБазДляРасчетаДопКодов.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<Enum>
		<Properties>
			<Name>ТипыБазДляРасчетаДопКодов</Name>
			<Comment>Типы баз для расчета доп кодов</Comment>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>НеИспользуется</Name>
					<Comment>Не используется</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Товары</Name>
					<Comment>Товары</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Работы</Name>
					<Comment>Работы</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>РаботыПоОкраске</Name>
					<Comment>Работы по окраске</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>РаботыПоРемонту</Name>
					<Comment>Работы по ремонту</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ТоварыИРаботы</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Catalogs/ДополнительныеКодыAudapadWeb/Ext/ManagerModule.bsl
// Модуль менеджера справочника "Дополнительные коды AudapadWeb"

#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда
	
#Область ПрограммныйИнтерфейс

#Область ДляВызоваИзДругихПодсистем

// СтандартныеПодсистемы.ВерсионированиеОбъектов
// Определяет настройки объекта для подсистемы ВерсионированиеОбъектов.
//
// Параметры:
//  Настройки - Структура - настройки подсистемы.  
//
Процедура ПриОпределенииНастроекВерсионированияОбъектов(Настройки) Экспорт
	
КонецПроцедуры

#КонецОбласти

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Процедура ЗаполнитьИзМакета() Экспорт
	#Если Клиент Тогда
		Состояние("Заполнение справочника дополнительных кодов...");
	#КонецЕсли
	Макет = ПолучитьМакет("ДополнительныеКодыОбмена");
	
	Сч = 1;
	Пока Сч <= Макет.ВысотаТаблицы Цикл
		НомерКода     = СокрЛП(Макет.Область(Сч, 1, Сч, 1).Текст);
		ТекстКода     = СокрЛП(Макет.Область(Сч, 2, Сч, 2).Текст);
		Применение    = СокрЛП(Макет.Область(Сч, 3, Сч, 3).Текст);
		Распределение = Число(Макет.Область(Сч, 4, Сч, 4).Текст);
		СкидкаНаценка = Макет.Область(Сч, 5, Сч, 5).Текст;
		База          = СокрЛП(Макет.Область(Сч, 6, Сч, 6).Текст);
		
		ДопКод = Справочники.ДополнительныеКодыAudapadWeb.НайтиПоРеквизиту("КодПоКлассификатору", НомерКода);
		
		Если НЕ ЗначениеЗаполнено(ДопКод) Тогда
			ДопКод = Справочники.ДополнительныеКодыAudapadWeb.СоздатьЭлемент();
			ДопКод.УстановитьНовыйКод();
		Иначе
			ДопКод = ДопКод.ПолучитьОбъект();
		КонецЕсли;
		
		ДопКод.Наименование        = ТекстКода;
		ДопКод.КодПоКлассификатору = НомерКода;
		
		Если Применение = "Рубли" Тогда
			ДопКод.ТипНачисления = Перечисления.ТипыНачисленийДопКодов.Сумма;
		ИначеЕсли Применение = "РП" Тогда
			ДопКод.ТипНачисления = Перечисления.ТипыНачисленийДопКодов.РП;
		Иначе
			ДопКод.ТипНачисления = Перечисления.ТипыНачисленийДопКодов.Процент;
		КонецЕсли;
		
		Если Распределение = 1 Тогда
			ДопКод.ТипРаспределения = Перечисления.ТипыРаспределенияДопКодов.НаТоварыИРаботы;
			ДопКод.Родитель = Справочники.ДополнительныеКодыAudapadWeb.ТоварыИРаботы;
		ИначеЕсли Распределение = 2 Тогда
			ДопКод.ТипРаспределения = Перечисления.ТипыРаспределенияДопКодов.НаТовары;
			ДопКод.Родитель = Справочники.ДополнительныеКодыAudapadWeb.Товары;
		Иначе
			ДопКод.ТипРаспределения = Перечисления.ТипыРаспределенияДопКодов.НаРаботы;
			ДопКод.Родитель = Справочники.ДополнительныеКодыAudapadWeb.Работы;
		КонецЕсли;
		
		ДопКод.СкидкаНаценка = (СкидкаНаценка = "+");
		
		Если База = "" Тогда
			ДопКод.БазаДляРасчета = Перечисления.ТипыБазДляРасчетаДопКодов.НеИспользуется;
		ИначеЕсли База = "1" Тогда
			ДопКод.БазаДляРасчета = Перечисления.ТипыБазДляРасчетаДопКодов.Товары;
		ИначеЕсли База = "2" Тогда
			ДопКод.БазаДляРасчета = Перечисления.ТипыБазДляРасчетаДопКодов.Работы;
		ИначеЕсли База = "3" Тогда
			ДопКод.БазаДляРасчета = Перечисления.ТипыБазДляРасчетаДопКодов.РаботыПоОкраске;
		ИначеЕсли База = "4" Тогда
			ДопКод.БазаДляРасчета = Перечисления.ТипыБазДляРасчетаДопКодов.РаботыПоРемонту;
		ИначеЕсли База = "5" Тогда
			ДопКод.БазаДляРасчета = Перечисления.ТипыБазДляРасчетаДопКодов.ТоварыИРаботы;
		КонецЕсли;
		
		Попытка
			ДопКод.ОбменДанными.Загрузка = Истина;
			ДопКод.Записать();
		Исключение
			ЗаписьЖурналаРегистрации(НСтр("ru = 'Ошибка при записи элемента'"),
			УровеньЖурналаРегистрации.Ошибка,,
			ДопКод,
			ПодробноеПредставлениеОшибки(ИнформацияОбОшибке()));
		КонецПопытки;
		
		Сч = Сч + 1;
	КонецЦикла;
	
	#Если Клиент Тогда
		Состояние("Заполнение справочника дополнительных кодов - окончено.");
	#КонецЕсли
КонецПроцедуры

#Область ПараметрыОбработкиРеквизитовОбъекта

// Производит формирование параметров проверки заполнения реквизитов объекта на предмет обязательности.
//
// Параметры:
//  Объект - ДанныеФормыСтруктура - Объект, для которого выполняется получение параметров проверки.
//
// Возвращаемое значение:
//  Массив - Возвращаемый массив содержит строковые идентификаторы реквизитов.
//
Функция ПолучитьОбязательныеРеквизиты(Объект) Экспорт
	
	// Обязательные реквизиты документа
	ОбязательныеРеквизиты = Новый Массив();
	ОбязательныеРеквизиты.Добавить("Наименование");
	
	Если НЕ Объект.ЭтоГруппа Тогда
		ОбязательныеРеквизиты.Добавить("ТипНачисления");
		ОбязательныеРеквизиты.Добавить("ТипРаспределения");
	КонецЕсли;
	
	// Возвращаем сформированные параметры проверки
	Возврат ОбязательныеРеквизиты;
	
КонецФункции // ПолучитьОбязательныеРеквизиты()

// Производит формирование параметров проверки заполнения реквизитов объекта на предмет обязательности и уникальности.
//
// Параметры:
//  Объект - ДанныеФормыСтруктура - Объект, для которого выполняется получение параметров проверки.
//
// Возвращаемое значение:
//  Структура - Возвращаемая структура содержит строковые идентификаторы реквизитов и вариант проверки его заполнения
//  (1-Обязательный, 2-Уникальный, 3-Уникальный и обязательный). Для описания проверки табличных частей используется
//  вложенная структура.
//
Функция ПолучитьУникальныеРеквизиты(Объект) Экспорт
	
	// Структура уникальных реквизитов
	УникальныеРеквизиты = Новый Структура();
	УникальныеРеквизиты.Вставить("Код");
	
	Если НЕ Объект.ЭтоГруппа Тогда
		УникальныеРеквизиты.Вставить("КодПоКлассификатору", 3);
	КонецЕсли;
	
	// Возвращаем сформированные параметры проверки
	Возврат УникальныеРеквизиты;
	
КонецФункции // ПолучитьОбязательныеРеквизиты()

#КонецОбласти

#КонецОбласти

#КонецЕсли
